app/Controllers/BaseController.php

SELECT *
FROM `users`
WHERE `users`.`id` = '1'
---
    protected function getUserInfo()
    {
        $userId = session()->get('updateId');
        $userModel = new UsersModel();
        $this->user = $userModel->find($userId);