app/Controllers/List_Ticket.php

    public function index()
    {
        $session = session('user');
        // Kiểm tra xem người dùng đã đăng nhập chưa
        if (!$session) {
            return redirect()->to('login');
        }
        // Sử dụng model Ticket thay vì model Users
        $ticketModel = new TicketsModel();

        $searchTerm = $this->request->getGet('q');

        if ($this->user['role'] === 'manager') {
            if (!empty($searchTerm)) {
                // Thực hiện tìm kiếm với điều kiện tên người dùng chứa từ khóa tìm kiếm
                $data['tickets'] = $ticketModel->like('title', $searchTerm)->orderBy('id', 'DESC')->paginate(10, 'group1');
            } else {
                // Nếu không có từ khóa tìm kiếm, lấy tất cả người dùng
                $data['tickets'] = $ticketModel->orderBy('id', 'DESC')->paginate(10, 'group1');
---
SELECT *
FROM `tickets`
WHERE `title` LIKE '%test%' ESCAPE '!'
ORDER BY `id` DESC
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `tickets`
WHERE `title` LIKE '%test%' ESCAPE '!'
SELECT *
FROM `tickets`
ORDER BY `id` DESC
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `tickets`