app/Controllers/Login.php

SELECT *
FROM `users`
WHERE `email` = 'admin@gmail.com'
 LIMIT 1
---
    protected function authenticate($email, $password)
    {
        // Lấy thông tin người dùng từ cơ sở dữ liệu
        $userModel = new UsersModel();
        $user = $userModel->findByEmail($email);