app/Controllers/ProfileController.php

SELECT *
FROM `users`
WHERE `users`.`id` = '1'
---
    public function changePassword()
    {
        $userModel = new UsersModel();
        //lấy id từ session
        $userId = session()->get('updateId');

        //tìm người dùng dựa vào id
        $user = $userModel->find($userId);