app/Controllers/Quan_ly.php

    public function index()
    {

        if ($this->user['role'] !== 'manager') {
            return view('Home', ['user' => $this->user]);
        }
        $dataUsers = new UsersModel();
        $data['users'] = $dataUsers->orderBy('id', 'DESC')->paginate(5, 'gruop1');
---
SELECT *
FROM `users`
ORDER BY `id` DESC
 LIMIT 10, 5
SELECT COUNT(*) AS `numrows`
FROM `users`

    public function dataUserTable()
    {
        $dataUsers = new UsersModel();
        $data['users'] = $dataUsers->orderBy('id', 'DESC')->paginate(5, 'gruop1');
---
SELECT *
FROM `users`
ORDER BY `id` DESC
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `users`

    public function getSingleUser($id)
    {
        $this->user = new UsersModel();
        $data = $this->user->find($id); // Sử dụng phương thức find() để lấy dữ liệu của user có id tương ứng
---
SELECT *
FROM `users`
WHERE `users`.`id` = '36'

    public function deleteUser()
    {
        $this->user = new UsersModel();
        $id = $this->request->getVar('id');
        $this->user->delete($id);
---
DELETE FROM `users`
WHERE `id` IN ('14')