app/Controllers/Quan_ly.php

SELECT *
FROM `users`
WHERE `role` = 'employee'
ORDER BY `id` DESC
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `role` = 'employee'
---
    public function index()
    {
        // dd($this->user);
        $session = session('user');
        // Kiểm tra xem người dùng đã đăng nhập chưa
        if (!$session) {
            return redirect()->to('login');
        }
        if ($this->user['role'] !== 'manager') {
            return view('Home', ['user' => $this->user]);
        }
        $dataUsers = new UsersModel();

        $searchTerm = $this->request->getGet('h');

        if (!empty($searchTerm)) {
            // Thực hiện tìm kiếm với điều kiện tên người dùng chứa từ khóa tìm kiếm
            $data['users'] = $dataUsers->where('role', 'employee')->like('name', $searchTerm)->orderBy('id', 'DESC')->paginate(10, 'group1');
        } else {
            // Nếu không có từ khóa tìm kiếm, lấy tất cả người dùng
            $data['users'] = $dataUsers->where('role', 'employee')->orderBy('id', 'DESC')->paginate(10, 'group1');

SELECT *
FROM `users`
WHERE `name` LIKE '%ga%' ESCAPE '!'
ORDER BY `id` DESC
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `name` LIKE '%ga%' ESCAPE '!'
SELECT *
FROM `users`
ORDER BY `id` DESC
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `users`
---
    public function index1()
    {
        // dd($this->user);
        // $session = session('user');
        // // Kiểm tra xem người dùng đã đăng nhập chưa
        // if (!$session) {
        //     return redirect()->to('login');
        // }
        // if ($this->user['role'] !== 'manager') {
        //     return view('Home', ['user' => $this->user]);
        // }
        $dataUsers = new UsersModel();

        $searchTerm = $this->request->getGet('h');

        if (!empty($searchTerm)) {
            // Thực hiện tìm kiếm với điều kiện tên người dùng chứa từ khóa tìm kiếm
            $data['users'] = $dataUsers->like('name', $searchTerm)->orderBy('id', 'DESC')->paginate(10, 'group1');
        } else {
            // Nếu không có từ khóa tìm kiếm, lấy tất cả người dùng
            $data['users'] = $dataUsers->orderBy('id', 'DESC')->paginate(10, 'group1');